{
  "lang": "ua",
  "tpi": [
    {
      "Stakeholder commitment": {
        "controlled": {
          "description": "Зацікавлені сторони зобов’язуються підтримувати тестовий процес шляхом надання та забезпечення узгоджених ресурсів.",
          "items": [
            "Головну зацікавлену сторону визначено (не обов’язково задокументовано) і вона відома тестувальникам.",
            "Бюджет на тестові ресурси надається головною зацікавленою стороною, і з нею можливе узгодження цього бюджету.",
            "Зацікавлені сторони фактично надають обіцяні ресурси.",
            "Головна зацікавлена сторона відповідає за документований аналіз ризиків продукту (що є вхідними даними для тестової стратегії)."
          ]
        },
        "efficient": {
          "description": "Зацікавлені сторони передбачають наслідки змін, що дозволяє тестовому процесу своєчасно реагувати.",
          "items": [
            "Усі релевантні зацікавлені сторони визначені (не обов’язково задокументовані) і відомі тестувальникам.",
            "Зацікавлені сторони активно отримують інформацію про якість як тестового процесу, так і об'єкта тестування.",
            "Зацікавлені сторони проактивно вживають заходів щодо аспектів, які впливають на тестовий процес. Це включає зміни у послідовності постачання об'єкта тестування та зміни в обсязі проєкту."
          ]
        },
        "optimized": {
          "description": "Зацікавлені сторони визнають і стимулюють удосконалення процесів як спільну відповідальність.",
          "items": [
            "Лінійне керівництво визнає, що вдосконалення тестового процесу потребує більше часу на навчання, і для цього виділяються ресурси.",
            "Зацікавлені сторони готові адаптувати свій спосіб роботи до вимог тестового процесу. Це включає розробку програмного забезпечення та управління вимогами.",
            "Адаптований спосіб роботи зацікавленої сторони відповідно до вимог тестового процесу спільно оцінюється тестовою організацією та зацікавленою стороною."
          ]
        }
      }
    },
    {
      "Degree of involvement": {
        "controlled": {
          "description": "Тестові активності розпочинаються заздалегідь, щоб забезпечити систематичну підготовку.",
          "items": [
            "Тестове завдання, обсяг і підхід узгоджуються на ранньому етапі з головною зацікавленою стороною як одна з перших тестових активностей.",
            "Тестові активності починаються заздалегідь, завчасно до виконання тестування, з метою утримання їх поза критичним шляхом проєкту.",
            "Тестувальник бере участь у плануванні проєкту: враховуються залежності між тестовим процесом та іншими процесами.",
            "Тестувальник бере участь в аналізі та зниженні загальних проєктних ризиків."
          ]
        },
        "efficient": {
          "description": "Залучення тестування забезпечує надійний вихід тестового процесу та запобігання дефектам.",
          "items": [
            "Тестувальники беруть участь в аналізі впливу та ризиків змінних запитів і змін у тестовій базі.",
            "Тестувальники беруть участь в аналізі впливу дефектів.",
            "Тестувальники активно беруть участь в оптимізації тестової бази (більше, ніж просто перевірка на можливість тестування), в якій описано об'єкт тестування."
          ]
        },
        "optimized": {
          "description": "Залучення тестування в межах проєкту дозволяє оптимізувати як сам проєкт, так і тестовий процес.",
          "items": [
            "Тестова команда бере участь в оцінюванні проєкту. Отримані уроки з тестового процесу цінуються та використовуються для (підготовки до) майбутніх проєктів.",
            "Тестова команда відіграє беззаперечну роль у всіх релевантних активностях розробки, її визнають і цінують."
          ]
        }
      }
    },
    {
      "Test strategy": {
        "controlled": {
          "description": "Тестова стратегія забезпечує розподіл зусиль і ресурсів між рівнями та активностями тестування.",
          "items": [
            "Головна зацікавлена сторона погоджується з задокументованою тестовою стратегією.",
            "Тестова стратегія ґрунтується на аналізі ризиків продукту.",
            "Визначено відмінності між рівнями тестування, типами тестів, охопленням та глибиною тестування відповідно до проаналізованих ризиків.",
            "Для повторного тестування та регресійного тестування використовується спрощене визначення стратегії."
          ]
        },
        "efficient": {
          "description": "Тестова стратегія використовується для досягнення балансу між ризиками продукту, покриттям тестування та наявними зусиллями й ресурсами з урахуванням усіх зацікавлених сторін.",
          "items": [
            "Усі релевантні зацікавлені сторони погоджуються з визначеною (і задокументованою) тестовою стратегією.",
            "Добре продумано перекриття або прогалини в тестовому покритті між рівнями чи типами тестування.",
            "Тестова стратегія включає відповідні техніки проєктування тестів."
          ]
        },
        "optimized": {
          "description": "Метод розробки тестової стратегії підтримується на належному рівні для забезпечення її легкої й коректної реалізації.",
          "items": [
            "Процес створення тестової стратегії регулярно оцінюється та за потреби адаптується для майбутнього використання.",
            "Сама тестова стратегія оцінюється на основі метрик інцидентів, що виникають у продакшені."
          ]
        }
      },
      "Test organization": {
        "controlled": {
          "description": "Тестова організація забезпечує єдність підходів, продуктів і процедур тестування, узгоджень та прозорих результатів.",
          "items": [
            "Залучені особи знають, до кого (чи якого відділу) звертатися з питань тестових послуг.",
            "У межах тестової організації існує структура контролю та відповідальності.",
            "Тестові завдання й обов’язки визначено (та задокументовано) і призначено конкретній особі або організаційній одиниці.",
            "Продукти та послуги тестової організації є зрозумілими для її клієнтів."
          ]
        },
        "efficient": {
          "description": "Тестова організація забезпечує наявність належної експертизи й досвіду в потрібному місці.",
          "items": [
            "Різні особи або відділи, що надають тестові послуги, узгоджують організацію своєї роботи.",
            "Тестова організація надає проєктам погоджені ресурси та послуги.",
            "Було прийнято обґрунтоване рішення щодо того, де й як позиціонувати тестову організацію.",
            "Виконується тестова політика."
          ]
        },
        "optimized": {
          "description": "Тестова організація забезпечує постійне покращення результатів завдяки тестовим послугам.",
          "items": [
            "Продукти й послуги тестової організації регулярно оцінюються; нові послуги додаються, якщо вони є економічно доцільними.",
            "Тестова організація несе відповідальність за успіх або провал тестових завдань.",
            "Результативність тестової організації регулярно порівнюється з зовнішніми постачальниками або подібними структурами."
          ]
        }
      }
    },
    {
      "Communication": {
        "controlled": {
          "description": "Комунікація інформації до всіх залучених осіб дає змогу ухвалювати відповідні рішення.",
          "items": [
            "Кожен учасник команди обізнаний щодо прийнятих рішень і внутрішнього прогресу.",
            "Тестова команда активно збирає релевантну інформацію від зацікавлених сторін.",
            "Можливо відстежити дії, домовленості й рішення тестової команди.",
            "Тестова команда обговорює зі стейкхолдерами прогрес, якість продукту й ризики, а також проактивно сигналізує про можливі затримки."
          ]
        },
        "efficient": {
          "description": "Чітка форма й зміст інформації для цільової аудиторії сприяє продуктивнішій роботі.",
          "items": [
            "Тестова команда визначає, яку інформацію і кому зі стейкхолдерів потрібно передавати.",
            "Тестова команда бере участь у відповідних зустрічах з іншими зацікавленими сторонами.",
            "Тестова команда має в своєму розпорядженні різні засоби комунікації, які дозволяють ефективно взаємодіяти зі стейкхолдерами."
          ]
        },
        "optimized": {
          "description": "Комунікація є засобом командоутворення.",
          "items": [
            "Найкращі практики та уроки, отримані щодо комунікації та її ефективності, оцінюються під час і після завершення тестового проєкту для подальшого використання.",
            "Організація досліджує нові засоби комунікації й формує відповідні політики."
          ]
        }
      },
      "Reporting": {
        "controlled": {
          "description": "Тестова команда й зацікавлені сторони узгоджують, що й як буде звітуватися, запобігаючи нестачі або надлишку інформації.",
          "items": [
            "Звітність включає аспекти часу й/або витрат, результати та ризики.",
            "Частота та зміст звітності відповідають базовим вимогам стейкхолдерів для процесу ухвалення рішень.",
            "Звітність ведеться у письмовій формі."
          ]
        },
        "efficient": {
          "description": "Звітність адаптована до конкретних цільових груп для підтримки процесу ухвалення рішень.",
          "items": [
            "Витрати на підготовку звітності врівноважуються з потребами стейкхолдерів у прийнятті рішень.",
            "Звітність містить тренди й рекомендації щодо прогресу тестового процесу та ризиків проєкту.",
            "Звітність містить тренди й рекомендації щодо тестових цілей і ризиків продукту."
          ]
        },
        "optimized": {
          "description": "Звітність надає інформацію, яка може бути використана для оптимізації життєвого циклу розробки ПЗ.",
          "items": [
            "Звітність надає дані й/або вимірювання, які можуть бути використані для покращення тестового процесу та життєвого циклу розробки програмного забезпечення — як нинішнього, так і в майбутньому.",
            "Ці дані й/або метрики передаються лінійній організації після завершення тестового проєкту."
          ]
        }
      },
      "Test process management": {
        "controlled": {
          "description": "Проактивне управління тестовим процесом дозволяє виконати тестове завдання.",
          "items": [
            "На початку тестового проєкту створюється тестовий план. Він включає щонайменше: тестове завдання, обсяг, планування, ролі та відповідальності.",
            "Тестовий план погоджується з головною зацікавленою стороною.",
            "Кожна тестова активність моніториться, і при необхідності вживаються коригувальні заходи.",
            "Тестовий план узгоджується з відповідними стейкхолдерами."
          ]
        },
        "efficient": {
          "description": "Управління тестовим процесом з чіткими повноваженнями дозволяє швидко коригувати хід тестового проєкту.",
          "items": [
            "Очікувані відхилення від тестового плану обговорюються з головною та іншими релевантними зацікавленими сторонами.",
            "Зміни в тестовому плані документуються.",
            "Тест-ліду делеговано повноваження на (повторний) розподіл ресурсів."
          ]
        },
        "optimized": {
          "description": "Уроки, отримані під час управління тестовим процесом, підвищують ефективність і результативність досягнення цілей тестових проєктів.",
          "items": [
            "Управління тестовим процесом регулярно оцінюється — як всередині тестової організації, так і разом із зацікавленими сторонами.",
            "Уроки, отримані з попередніх тестових проєктів, використовуються для покращення управління тестовим процесом."
          ]
        }
      }
    },
    {
      "Estimating and planning": {
        "controlled": {
          "description": "Прогнозується обсяг ресурсів, необхідних для кожної активності.",
          "items": [
            "Для оцінки зусиль на тестування використовуються прості техніки, такі як співвідношення.",
            "Для кожної тестової активності вказується період її виконання, необхідні ресурси та продукти, які мають бути поставлені. До таких активностей належать: планування та керування тестуванням, визначення тест-кейсів і їх виконання.",
            "Залежності між фазами тестування або тестовими активностями відображаються в тестовому плануванні. Допускається певне перекриття між фазами та активностями.",
            "Оцінки та планування тестування обговорюються з головною зацікавленою стороною."
          ]
        },
        "efficient": {
          "description": "Формальні техніки роблять оцінювання й планування надійними.",
          "items": [
            "Щоб бути максимально точними, використовуються щонайменше дві техніки оцінювання.",
            "Фази тестування та/або тестові активності оцінюються та плануються із застосуванням формальних технік.",
            "Для підтримки оцінювання та планування використовуються метрики.",
            "Планування тестування включає перевірку тестової бази на тестованість і оцінку тестового проєкту."
          ]
        },
        "optimized": {
          "description": "Оцінювання ґрунтується на фактичних даних організації.",
          "items": [
            "Планування тестування включає збереження тествару для повторного використання в майбутньому.",
            "Набір технік і принципів оцінювання підтримується на рівні організації.",
            "Ключові показники/дані для визначених технік оцінювання надаються на організаційному рівні."
          ]
        }
      },
      "Metrics": {
        "controlled": {
          "description": "Використовуючи визначені метрики, можливо оцінювати та контролювати тестовий процес.",
          "items": [
            "У тестовому процесі визначено метрики, які використовуються для оцінки й контролю тестового проєкту.",
            "Необхідні вхідні дані для метрик фіксуються уніфіковано, а самі метрики зберігаються систематично.",
            "Достовірність вхідних даних для метрик може бути підтверджена."
          ]
        },
        "efficient": {
          "description": "Об'єктивність, яку надають метрики, переважає витрати на збір і аналіз даних.",
          "items": [
            "Зусилля, необхідні для збору, аналізу та оцінки даних, зіставляються з вигодами.",
            "Збір метрик не заважає прогресу та якості тестового процесу.",
            "У межах тестового процесу метрики визначаються та використовуються для вимірювання його ефективності.",
            "Висновки, отримані з аналізу метрик, обговорюються зі стейкхолдерами та реалізуються на практиці."
          ]
        },
        "optimized": {
          "description": "Метрики відповідають змінним інформаційним потребам.",
          "items": [
            "Відстежується, як метрики задовольняють потребу в інформації.",
            "Зміни в інформаційних потребах призводять до появи нових або вдосконалення існуючих метрик."
          ]
        }
      }
    },
    {
      "Defect management": {
        "controlled": {
          "description": "Дефекти відстежуються на індивідуальному рівні, а їхній статус контролюється.",
          "items": [
            "Життєвий цикл дефекту визначений (включно з повторним тестуванням) і впроваджений.",
            "Для кожного дефекту реєструються: унікальний ID, пов'язаний тест-кейс (якщо є), особа, яка зареєструвала дефект, дата, категорія серйозності, опис (дії для відтворення, очікуваний і фактичний результат), статус дефекту.",
            "Визначено відповідальних за подальше опрацювання дефектів.",
            "Усі залучені до оцінки й усунення дефектів мають доступ до відповідного інструмента керування дефектами."
          ]
        },
        "efficient": {
          "description": "Аналізуються спільні риси дефектів для виявлення подібних.",
          "items": [
            "Інструмент керування дефектами забезпечує контроль доступу для зміни статусів дефектів.",
            "Усі, хто фіксує та/або відстежує дефекти, використовують один і той самий інструмент або сумісні інструменти з безшовною інтеграцією.",
            "Адміністрування дефектів дозволяє створювати розширені звіти, які можна сортувати та фільтрувати різними способами.",
            "Визначаються тренди. Для цього реєструється додаткова інформація: підсистема, пріоритет, програма і версія, тестова база і її версія, першопричина, усі зміни статусу й відповідальний за вирішення."
          ]
        },
        "optimized": {
          "description": "Аналіз дефектів за спільними характеристиками допомагає уникати їх у майбутньому.",
          "items": [
            "Лінійна або проєктна організація надає та впроваджує набір вказівок для управління дефектами в кожному тестовому проєкті.",
            "Управління дефектами — це відповідальність лінійної чи проєктної організації, а тестовий процес надає необхідні дані.",
            "Проводиться аналіз дефектів за спільними характеристиками й формуються рекомендації для їх запобігання."
          ]
        }
      },
      "Testware management": {
        "controlled": {
          "description": "Усі використані тестові й проєктні документи в затвердженому стані ідентифікуються та реєструються окремо.",
          "items": [
            "Тестова база, об’єкт тестування та всі тестові матеріали ідентифікуються за назвою та версією.",
            "Кожен тест-кейс прозоро пов'язаний з відповідним документом тестової бази.",
            "Тестова команда має доступ до всіх елементів, що перебувають під управлінням тествару.",
            "Процедура керування тестовими матеріалами, тестовою базою та об'єктом тестування є явно задокументованою й відомою команді."
          ]
        },
        "efficient": {
          "description": "Зв'язки між усіма (тестовими) артефактами відомі й підтримуються в актуальному стані.",
          "items": [
            "Тестова база, об’єкт тестування та тестові матеріали мають посилання з назвою та версією.",
            "Забезпечено простежуваність між тест-кейсами та вимогами.",
            "Управління тестваром підтримується логічною структурою зберігання, ролями та системою авторизацій."
          ]
        },
        "optimized": {
          "description": "Тестові матеріали доступні для повторного використання в майбутніх проєктах і дійсно повторно використовуються.",
          "items": [
            "На початку тестового проєкту узгоджується (і переглядається в процесі), які матеріали будуть збережені після завершення проєкту.",
            "Існують інструкції щодо збереження тествару для повторного використання, а фактичне повторне використання вимірюється.",
            "Після завершення проєкту тестові матеріали, що передаються на супровід, легко відокремлюються від тих, що не підлягають супроводу."
          ]
        }
      },
      "Methodology practice": {
        "controlled": {
          "description": "Описаний тестовий метод забезпечує передбачуване виконання тестових активностей.",
          "items": [
            "Тестовий процес базується на задокументованому методі: метод описує набір тестових активностей, тестові продукти й додаткові вимоги до способу роботи.",
            "Тестовий метод відповідає методу розробки, який використовується в проєкті.",
            "Тестові команди вважають впроваджений метод корисним у практиці."
          ]
        },
        "efficient": {
          "description": "Описаний метод тестування забезпечує практичну підтримку для тестових проєктів.",
          "items": [
            "Метод описує для кожної тестової активності її мету, відповідальну роль, використовувані техніки та передумови.",
            "Метод включає повний і вичерпний набір шаблонів.",
            "У методі зазначено обов’язкові, умовні та необов’язкові елементи.",
            "Обов’язкові й умовні елементи реалізуються на практиці."
          ]
        },
        "optimized": {
          "description": "Відхилення від методу оцінюються й використовуються для його вдосконалення.",
          "items": [
            "Тестові команди регулярно надають зворотний зв'язок щодо тестового методу.",
            "Впроваджений тестовий метод постійно вдосконалюється й поліпшується."
          ]
        }
      }
    },
    {
      "Tester professionalism": {
        "controlled": {
          "description": "Завдяки спеціальним навичкам і компетенціям у сфері тестування тестувальник робить процес більш передбачуваним і керованим.",
          "items": [
            "Тестувальники пройшли спеціальне навчання або мають достатній досвід у структурованому тестуванні.",
            "Тестувальники знайомі з прийнятим методом тестування і застосовують його на практиці.",
            "Уся необхідна експертиза — галузева, бізнесова чи технічна — доступна тестовій команді.",
            "Тестувальників регулярно оцінюють як за спеціалізованими навичками тестування, так і за загальними ІТ-компетенціями під час оцінки ефективності роботи."
          ]
        },
        "efficient": {
          "description": "Тестовий персонал має спеціальну роль або функцію в тестуванні та виконує завдання згідно з очікуваннями.",
          "items": [
            "Тестувальники мають сертифікацію в галузі тестування (наприклад, TMap Next або ISTQB).",
            "Тестувальники можуть пояснити логіку обраних технік, які були застосовані.",
            "Тестувальники отримують задоволення від роботи й підтримують добрі стосунки з іншими спеціалістами в проєкті.",
            "Тестові завдання визначено, призначено й виконано відповідно до очікувань."
          ]
        },
        "optimized": {
          "description": "Тестувальники діють із позиції забезпечення якості, постійно розвиваючи та вдосконалюючи свої навички.",
          "items": [
            "Тестувальники активно беруть участь у спеціалізованих групах, відвідують семінари або читають фахову літературу для підтримки своєї кваліфікації.",
            "Функції тестування є частиною HR-системи та особистого кар'єрного розвитку в організації.",
            "Тестувальники прагнуть до відповідальності за свою роботу та до постійного вдосконалення процесу її виконання."
          ]
        }
      },
      "Test case design": {
        "controlled": {
          "description": "Тест-кейси забезпечують повторюваність виконання тестів і незалежність від конкретної особи.",
          "items": [
            "Тест-кейси задокументовано на логічному рівні.",
            "Тест-кейси складаються з опису: а) початкової ситуації, б) процесу змін = дій, що виконуються під час тесту, в) очікуваного результату.",
            "Тест-кейси дають уявлення про те, яка частина тестової бази (яка описує певну поведінку системи) перевіряється."
          ]
        },
        "efficient": {
          "description": "Проєктування тест-кейсів із фокусом на досягнення певного покриття є обґрунтованою реалізацією тестової стратегії.",
          "items": [
            "Тест-кейси зрозумілі та підтримувані колегами всередині тестової організації.",
            "Відомий рівень покриття тестової бази, досягнутий за допомогою тест-кейсів.",
            "Для створення тест-кейсів використовуються формальні техніки тест-дизайну.",
            "Для перевірки якостей, які не піддаються формалізації через тест-кейси, застосовуються чеклісти."
          ]
        },
        "optimized": {
          "description": "Оцінка тест-кейсів, технік тест-дизайну та дефектів дає змогу підвищити ефективність тестування.",
          "items": [
            "Дефекти, виявлені на наступних рівнях (наступний тестовий рівень або продакшен), аналізуються з метою покращення точності та ефективності тест-кейсів.",
            "Тест-кейси перевіряються й оцінюються незалежно щодо їхньої валідності та зручності підтримки.",
            "Техніки тест-дизайну оцінюються та коригуються для подальшого повторного використання."
          ]
        }
      },
      "Test tools": {
        "controlled": {
          "description": "Інструменти тестування, необхідні для виконання конкретних активностей, доступні й використовуються.",
          "items": [
            "Необхідні тестові інструменти доступні тестовій команді й використовуються для досягнення цілей тестування.",
            "Інформація про використовувані тестові інструменти доступна.",
            "Усі залучені, включно з відділом закупівель, вважають використання конкретного тестового інструменту доцільним."
          ]
        },
        "efficient": {
          "description": "Тестові інструменти використовуються для прискорення окремих активностей.",
          "items": [
            "Поточні інструменти тестування обрано для прискорення, здешевлення або підвищення керованості процесу тестування.",
            "Інструменти доступні тестувальникам у будь-який необхідний момент.",
            "Для кожного впровадженого тестового інструменту створено бізнес-кейс.",
            "Використання цих інструментів інтегроване в тестовий процес."
          ]
        },
        "optimized": {
          "description": "Інструменти тестування та їхнє використання постійно оцінюються й удосконалюються.",
          "items": [
            "Політика щодо інструментів створена та підтримується в синхронізації з тестовою політикою.",
            "Експертиза, найкращі практики й продукти, пов’язані з інструментами тестування, збираються та публікуються для використання в майбутніх проєктах.",
            "Інструменти тестування регулярно оцінюються щодо досягнення цілей, визначених у бізнес-кейсі та політиці щодо інструментів."
          ]
        }
      },
      "Test environment": {
        "controlled": {
          "description": "Зміни в тестовому середовищі не відбуваються несподівано.",
          "items": [
            "Вимоги до тестового середовища задокументовано.",
            "Укладено робочі домовленості з постачальниками тестового середовища, які містять завдання та відповідальності.",
            "Тестове середовище доступне команді тестування у погоджений час.",
            "Менеджера з тестування завчасно інформують про заплановані зміни в середовищі."
          ]
        },
        "efficient": {
          "description": "Тестове середовище безпосередньо відповідає вимогам відповідного рівня або типу тестування.",
          "items": [
            "Прийняття тестового середовища здійснюється заздалегідь створеним чеклістом.",
            "Розробляється логічна або функціональна схема тестового середовища, яка охоплює застосунки, системи, їхні зв’язки та використання стабів і драйверів (мокапів).",
            "Постачальники надають технічний дизайн тестового середовища, який офіційно затверджується тест-менеджером або спеціалістом із середовищ.",
            "Домовленості з постачальниками мають характер угоди про рівень послуг (SLA)."
          ]
        },
        "optimized": {
          "description": "Тестові середовища надаються тестувальникам як сервіс.",
          "items": [
            "Власником тестових середовищ є окремий підрозділ.",
            "Використання тестових середовищ регламентується стандартним контрактом.",
            "Описано, які сервіси щодо тестових середовищ включено й не включено до сфери дії, у каталозі послуг."
          ]
        }
      }
    }
  ]
}